In [2]:
import pandas as pd

# creating a sample data frame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
       'Age': [25,30,22,35],
       'Salary': [5000, 6000, 7000, 8000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [3]:
df.sort_values(by='Age', ascending=False) # default is ascending

      Name  Age  Salary
3    David   35    8000
1      Bob   30    6000
0    Alice   25    5000
2  Charlie   22    7000

In [6]:
sorted_df = df.sort_values(by = ['Age', 'Salary'], ascending=[True, False])
sorted_df

      Name  Age  Salary
2  Charlie   22    7000
0    Alice   25    5000
1      Bob   30    6000
3    David   35    8000

In [7]:
sorted_df.sort_index()

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [8]:
sorted_df.sort_index(ascending=True)

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [9]:
sorted_df

      Name  Age  Salary
2  Charlie   22    7000
0    Alice   25    5000
1      Bob   30    6000
3    David   35    8000

In [11]:
# to permanently change the sorted array use inplace
sorted_df.sort_index(ascending=True, inplace=True)
sorted_df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   30    6000
2  Charlie   22    7000
3    David   35    8000

In [14]:
t1 = [('X',1), ('X',2), ('Y',3), ('Y',4)]
name = ['group', 'subgroup']
data2 = {'Pw' : [3,1,2,4], 'PWIOI' : [9,7,6,8]}

index = pd.MultiIndex.from_tuples(t1,names=name)
index

MultiIndex([('X', 1),
            ('X', 2),
            ('Y', 3),
            ('Y', 4)],
           names=['group', 'subgroup'])

In [15]:
df2 = pd.DataFrame(data2, index=index)
df2

                Pw  PWIOI
group subgroup
X     1          3      9
      2          1      7
Y     3          2      6
      4          4      8

In [16]:
df2.sort_index(level = ['group', 'subgroup'], ascending=False)

                Pw  PWIOI
group subgroup
Y     4          4      8
      3          2      6
X     2          1      7
      1          3      9